OpenNuvoton/M55M1BSP/SampleCode/SecureApplication/SecureISPDemo/ISPSource/CommandHandler.c
    DBG("d:  %s\n", d);
    DBG("Qx: %s\n", Qx);
    DBG("Qy: %s\n", Qy);
    ret = ECC_GenerateSecretZ(CRYPTO, CURVE_P_SIZE, d, Qx, Qy, z);

    if (ret < 0)
    {
        memset(d,  0x0, sizeof(d));
        memset(Qx, 0x0, sizeof(Qx));
        memset(Qy, 0x0, sizeof(Qy));
        memset(z,  0x0, sizeof(z));
        return -1;
    }

    DBG("z:  %s\n", z);

    Hex2Reg(z, Key);
    BytesSwap((char *)Key, (ECC_KEY_SIZE / 8));

    memset(d,  0x0, sizeof(d));
    memset(Qx, 0x0, sizeof(Qx));
    memset(Qy, 0x0, sizeof(Qy));
    memset(z,  0x0, sizeof(z));

    DBG("\n");
    return 0;
}

static int32_t GenRandomPrivKey(char *d, int32_t nbits)
{
    volatile int32_t    i, j;
    uint32_t             au32Buf[8];
    uint8_t             *pu8Buf, u8Data;

    do
    {
        /* Generate random number for private key */
        if (RNG_Random(au32Buf, 8) == 0)
            return -1;

        pu8Buf = (uint8_t *)au32Buf;

        for (i = 0, j = 0; i < (nbits / 8); i++)
        {
            u8Data = B2C(pu8Buf[i] & 0xf);
            d[j++] = u8Data;
            u8Data = B2C(pu8Buf[i] >> 4);
            d[j++] = u8Data;
        }

        d[j] = 0; // NULL end

        /* Check if the private key valid */
        if (ECC_IsPrivateKeyValid(CRYPTO, CURVE_P_SIZE, d))
        {
            return 0;
        }
        else
        {
            /* Invalid key */
            DBG("Current private key is not valid. Need a new one.\n");
            return -1;
        }
    } while (1);
}

static int32_t GenRandomECCKeyPair(uint32_t *priv, ECC_PUBKEY_T *pubkey)
{
    volatile int32_t    ret;
    char                d[70], k0[70], k1[70];

    memset(d,  0x0, sizeof(d));
    memset(k0, 0x0, sizeof(k0));
    memset(k1, 0x0, sizeof(k1));

    do
    {
        /* select random k */
        if ((ret = GenRandomPrivKey(d, ECC_KEY_SIZE)) != 0)
        {
            break;
        }

        if ((ret = ECC_GeneratePublicKey(CRYPTO, CURVE_P_SIZE, d, k0, k1)) != 0)
        {
            DBG("\nECC key generation failed!!\n\n");
            break;
        }

        DBG("d:  %s\n", d);
        DBG("k0: %s\n", k0);
        DBG("k1: %s\n", k1);
        Hex2Reg(d,  priv);
        Hex2Reg(k0, pubkey->au32Key0);
        Hex2Reg(k1, pubkey->au32Key1);
        BytesSwap((char *)priv,             sizeof(pubkey->au32Key0)); // 256-bits
        BytesSwap((char *)pubkey->au32Key0, sizeof(pubkey->au32Key0));
        BytesSwap((char *)pubkey->au32Key1, sizeof(pubkey->au32Key1));
    } while (0);

    memset(d,  0x0, sizeof(d));
    memset(k0, 0x0, sizeof(k0));
    memset(k1, 0x0, sizeof(k1));

    return ret;
}

/*
    Stage 2.
    Valid commands:
        "CMD_RESYNC"             "CMD_DISCONNECT"
        "CMD_ECDH_PUB0"          "CMD_ECDH_PUB1"
        "CMD_ECDH_GET_PUB0"      "CMD_ECDH_GET_PUB1"
        "CMD_ECDH_RAND_PUB0"     "CMD_ECDH_RAND_PUB1"
        "CMD_ECDH_GET_RAND_PUB0" "CMD_ECDH_GET_RAND_PUB1"
*/
int32_t ParseECDH(ISP_INFO_T *pISPInfo)
{
    volatile int32_t    i, ret = 0, cmd_case;
    CMD_PACKET_T        cmd;
    uint32_t            AESKey[8], u32Data;
    ECC_PUBKEY_T        randpub;
    uint32_t            priv[8];

    memset(&cmd,             0x0, sizeof(CMD_PACKET_T));
    memset(pISPInfo->rspbuf, 0x0, sizeof(pISPInfo->rspbuf));

    memcpy(&cmd, pISPInfo->rcvbuf, sizeof(cmd));

    do
    {
        /* plaint text cmd */
        if (cmd.u16CmdID == CMD_RESYNC)
        {
            cmd.au32Data[0] = STS_OK;
            cmd.u16Len      = (4 * 1);
            ret = cmd.u16CmdID;
            pISPInfo->IsConnectOK = 0;
            break;
        }

        if (CMD_ParseReqPacket(&cmd, pISPInfo) != 0)
        {
            DBG("*** [Pasre error: 0x%x] ***\n", cmd.u16CmdID);
            memset(cmd.au32Data, 0x0, sizeof(cmd.au32Data));

            cmd.au32Data[0] = ERR_CMD_CHECKSUM;
            cmd.u16Len      = (4 * 1);
            ret = -1;
            break;
        }
        else
        {
            cmd_case = cmd.u16CmdID;

            switch (cmd_case)
            {
                case CMD_DISCONNECT:
                    DBG("[CMD_DISCONNECT] (stage 2)\n");
                    memset(cmd.au32Data, 0x0, sizeof(cmd.au32Data));

                    cmd.au32Data[0] = STS_OK;
                    cmd.u16Len      = (4 * 1);
                    ret = cmd.u16CmdID;
                    pISPInfo->IsConnectOK = 0;
                    break;

                case CMD_ECDH_PUB0:
                    /* Get Server public key 0 */
                    memcpy(pISPInfo->ServerPubKey.au32Key0, cmd.au32Data, cmd.u16Len);

                    for (i = 0; i < 8; i++)
                        DBG("Get pub0[%d]: 0x%08x.\n", i, pISPInfo->ServerPubKey.au32Key0[i]);

                    memset(cmd.au32Data, 0x0, sizeof(cmd.au32Data));
                    cmd.au32Data[0] = STS_OK;
                    cmd.u16Len      = (4 * 1);
                    ret = cmd.u16CmdID;
                    break;

                case CMD_ECDH_PUB1:
                    /* Get Server public key 1 and generate ist ECDH AES key */
                    memcpy(pISPInfo->ServerPubKey.au32Key1, cmd.au32Data, cmd.u16Len);

                    for (i = 0; i < 8; i++)
                        DBG("Get pub1[%d]: 0x%08x.\n", i, pISPInfo->ServerPubKey.au32Key1[i]);

                    /* TODO : user can identify server's public key here... */

                    if (pISPInfo->pfnGenKeyFunc == 0)
                    {
                        cmd.au32Data[0] = ERR_PARAMETER;
                        cmd.u16Len      = (4 * 1);
                        ret = -1;
                        break;
                    }

                    if (pISPInfo->pfnGenKeyFunc(&pISPInfo->ServerPubKey, AESKey) != 0)
                    {
                        cmd.au32Data[0] = ERR_PARAMETER;
                        cmd.u16Len      = (4 * 1);
                        ret = -1;
                        break;
                    }

                    //                    /* Generate 1st ECDH AES key */
                    //                    Hex2Reg((char *)gacPrivKey,  priv);
                    //                    BytesSwap((char *)priv, sizeof(priv)); // 256-bits
                    //                    if(GenECDHKey(priv, &pISPInfo->ServerPubKey, AESKey) != 0)
                    //                    {
                    //                        cmd.au32Data[0] = ERR_PARAMETER;
                    //                        cmd.u16Len      = (4 * 1);
                    //                        ret = -1;
                    //                        break;
                    //                    }
                    for (i = 0; i < 8; i++)
                    {
                        u32Data = Swap32(AESKey[i]);
                        AESKey[i] = u32Data;
                    }

                    memset(cmd.au32Data, 0x0, sizeof(cmd.au32Data));
                    cmd.au32Data[0] = STS_OK;
                    cmd.u16Len      = (4 * 1);
                    ret = cmd.u16CmdID;
                    break;

