OpenNuvoton/M55M1BSP/SampleCode/SecureApplication/SecureISPDemo/ISPSource/CommandHandler.c
            for (i = 0; i < 8; i++)
                DBG("Gen 2nd ECDH AES KEY[%d]: 0x%08x.\n", i, pISPInfo->au32AESKey[i]);

            memset(pISPInfo->tmp0, 0x0, sizeof(AESKey));
        }
    }

    memset(AESKey, 0x0, sizeof(AESKey));

    DBG("Repone.\n\n");
    return ret;
}

int32_t _PageErase(uint32_t u32Addr, uint32_t u32Count, uint32_t u32CmdMask)
{
    uint32_t i;
    int32_t  ret = -1;

    NVT_UNUSED(u32CmdMask);
    DBG("[Page erase] u32Addr: 0x%x, page counts: %d.\n", u32Addr, u32Count);

    u32Addr &= ~NS_OFFSET;

    /* Check address and counts */
    if (((u32Addr % FMC_FLASH_PAGE_SIZE) != 0) || (u32Count == 0))
        return ERR_PAGE_ALIGN;

    /* Not use u32CmdMask */
    //    /* Check for erase LDROM or APROM */
    //    if(u32Addr & FMC_LDROM_BASE)
    //    {
    //        if(u32CmdMask & MASK_UPDATE_LDROM)
    //            return CMD_IS_MASKED;
    //    }
    //    else
    //    {
    //        if(u32CmdMask & MASK_UPDATE_APROM)
    //            return CMD_IS_MASKED;
    //    }

    if ((u32Addr < GetMaxAPROMSize()) && (u32Addr >= FMC_APROM_BASE))
    {
        if (u32Count > (GetMaxAPROMSize() / FMC_FLASH_PAGE_SIZE))
            return ERR_OVER_RANGE;

        if ((u32Addr + (u32Count * FMC_FLASH_PAGE_SIZE)) > GetMaxAPROMSize())
            return ERR_OVER_RANGE;

        FMC_ENABLE_AP_UPDATE();
    }
    else if ((u32Addr < FMC_LDROM_END) && (u32Addr >= FMC_LDROM_BASE))
    {
        if (u32Count > (FMC_LDROM_SIZE / FMC_FLASH_PAGE_SIZE))
            return ERR_OVER_RANGE;

        if ((u32Addr + (u32Count * FMC_FLASH_PAGE_SIZE)) > FMC_LDROM_END)
            return ERR_OVER_RANGE;

        FMC_ENABLE_LD_UPDATE();
    }
    else
    {
        return ERR_OVER_RANGE;
    }

    for (i = 0; i < u32Count; i++)
    {
        ret = ERR_ISP_ERASE;

        /* perform erase page */
        if (FMC_Erase(u32Addr) < 0)
            break;

        /* Run 2 page checksum and verify its result */
        if (FMC_GetChkSum(u32Addr, FMC_FLASH_PAGE_SIZE) != ALL_ONE_2PAGE_CHKS)
            break;

        u32Addr += FMC_FLASH_PAGE_SIZE;
        ret = 0;
    }

    FMC_DISABLE_AP_UPDATE();
    FMC_DISABLE_LD_UPDATE();
    return ret;
}

static int32_t _IsValidFlashRegion(uint32_t u32Addr, uint32_t size, uint32_t u32CmdMask)
{
    NVT_UNUSED(u32CmdMask);
    DBG("[Check flash region] u32Addr: 0x%x, size: %d.\n", u32Addr, size);

    /* Not use u32CmdMask */

    u32Addr &= ~NS_OFFSET;

    /* Check address and length */
    if ((u32Addr % 4) != 0)
        return ERR_INVALID_ADDRESS;

    if (((size % 4) != 0) || (size == 0))
        return ERR_INVALID_ADDRESS;

    /* Not use u32CmdMask */
    //    /* Check for erase LDROM or APROM */
    //    if(u32Addr & FMC_LDROM_BASE)
    //    {
    //        if(u32CmdMask & MASK_UPDATE_LDROM)
    //            return CMD_IS_MASKED;
    //    }
    //    else
    //    {
    //        if(u32CmdMask & MASK_UPDATE_APROM)
    //            return CMD_IS_MASKED;
    //    }

    if ((u32Addr < GetMaxAPROMSize()) && (u32Addr >= FMC_APROM_BASE))
    {
        if (((u32Addr + size) > GetMaxAPROMSize()) || ((u32Addr + size) < u32Addr))
            return ERR_OVER_RANGE;

        FMC_ENABLE_AP_UPDATE();
    }
    else if ((u32Addr < FMC_LDROM_END) && (u32Addr >= FMC_LDROM_BASE))
    {
        if (((u32Addr + size) > FMC_LDROM_END) || ((u32Addr + size) < u32Addr))
            return ERR_OVER_RANGE;

        FMC_ENABLE_LD_UPDATE();
    }
    else
    {
        return ERR_OVER_RANGE;
    }

    return 0;
}

static int32_t _ISPWrite(uint32_t u32Addr, uint32_t data)
{
    FMC->ISPCMD  = FMC_ISPCMD_PROGRAM;
    FMC->ISPADDR = u32Addr;
    FMC->ISPDAT  = data;
    FMC->ISPTRG  = FMC_ISPTRG_ISPGO_Msk;

    while (FMC->ISPTRG & FMC_ISPTRG_ISPGO_Msk) ;

    /* Clear ISPFF if cmd FAIL */
    if (FMC->ISPCTL & FMC_ISPCTL_ISPFF_Msk)
    {
        FMC->ISPCTL |= FMC_ISPCTL_ISPFF_Msk;
        return -1;
    }

    return 0;
}

static uint32_t _ISPRead(uint32_t u32Addr)
{
    FMC->ISPCMD  = FMC_ISPCMD_READ;
    FMC->ISPADDR = u32Addr;
    FMC->ISPTRG  = FMC_ISPTRG_ISPGO_Msk;

    while (FMC->ISPTRG & FMC_ISPTRG_ISPGO_Msk) { }

    /* Clear ISPFF if cmd FAIL */
    if (FMC->ISPSTS & FMC_ISPSTS_ISPFF_Msk)
    {
        FMC->ISPSTS |= FMC_ISPSTS_ISPFF_Msk;
        return -1;
    }

    return FMC->ISPDAT;
}

static int32_t _WriteFlash(uint32_t u32Addr, uint32_t size, uint32_t *pu32Data, uint32_t u32CmdMask)
{
    uint32_t i;
    int32_t ret = -1;

    DBG("[Write flash] u32Addr: 0x%x, size: %d.\n", u32Addr, size);

    if ((ret = _IsValidFlashRegion(u32Addr, size, u32CmdMask)) != 0)
        return ret;

    u32Addr &= ~NS_OFFSET;

    for (i = 0; i < (size / 4); i++)
    {
        /* write */
        if (_ISPWrite(u32Addr, pu32Data[i]) != 0)
        {
            ret = ERR_ISP_WRITE;
            break;
        }

        /* verify */
        if (_ISPRead(u32Addr) != pu32Data[i])
        {
            ret = ERR_ISP_WRITE;
            break;
        }

        u32Addr += 4;
        ret = 0;
    }

    FMC_DISABLE_AP_UPDATE();
    FMC_DISABLE_LD_UPDATE();
    return ret;
}

/*
    Stage 3.
    Valid commands:
        "CMD_RESYNC"         "CMD_DISCONNECT"
        "CMD_GET_VERSION"    "CMD_RESET"
        "CMD_WRITE"          "CMD_ERASE"
        "CMD_SET_MASS_WRITE" "CMD_MASS_WRITE"
        "CMD_READ_CONFIG"    "CMD_UPDATE_CFG"
        "CMD_READ_OTP"       "CMD_WRITE_OTP" // Do NOT use "CMD_WRITE_OTP"
        "CMD_SET_REGION_LOCK"
        "CMD_XOM_SET"        "CMD_XOM_ERASE"
        "CMD_ERASE_KPROM"    "CMD_SET_KPROM"     "CMD_AUTH_KPROM"    "CMD_KPROM_STS"
        "CMD_GET_RAND_IV"    "CMD_SET_RAND_IV"   "CMD_GET_ID_SIGNATURE"
        "CMD_IDENTIFY_SERVER"
        "CMD_MASS_ERASE"
        "CMD_SET_NS"
*/
int32_t ParseCommands(ISP_INFO_T *pISPInfo)
{
    volatile int32_t    ret = 0, cmd_case;
    CMD_PACKET_T        cmd;
    uint32_t            u32Addr, size;
    uint32_t            msg[8], R[8], S[8];
    ECC_PUBKEY_T        PubKey;

    memset(&cmd,             0x0, sizeof(CMD_PACKET_T));
    memset(pISPInfo->rspbuf, 0x0, sizeof(pISPInfo->rspbuf));
    memset(msg, 0x0, sizeof(msg));
    memset(R, 0x0, sizeof(R));
    memset(S, 0x0, sizeof(S));
    memset(&PubKey, 0x0, sizeof(ECC_PUBKEY_T));

    memcpy(&cmd, pISPInfo->rcvbuf, sizeof(cmd));

    do
    {
        /* plaint text cmd */
        if (cmd.u16CmdID == CMD_RESYNC)
        {
            cmd.au32Data[0] = STS_OK;
            cmd.u16Len      = (4 * 1);
            ret = cmd.u16CmdID;
            pISPInfo->IsConnectOK = 0;
            break;
        }

        if (CMD_ParseReqPacket(&cmd, pISPInfo) != 0)
        {
            DBG("*** [Parse error: 0x%x] ***\n", cmd.u16CmdID);
            memset(cmd.au32Data, 0x0, sizeof(cmd.au32Data));

            cmd.au32Data[0] = ERR_CMD_CHECKSUM;
            cmd.u16Len      = (4 * 1);
            ret = -1;
            break;
        }
        else
        {
            cmd_case = cmd.u16CmdID;

            switch (cmd_case)
            {
                case CMD_DISCONNECT:
                    DBG("[CMD_DISCONNECT] (stage 3)\n");
                    memset(cmd.au32Data, 0x0, sizeof(cmd.au32Data));

